# Pandas Pertemuan 1

## penggunaan Prefix, suffix, dan membuat data frame

https://www.youtube.com/watch?v=mW6nDCbM2o0

In [2]:
import pandas as pd
import numpy as np
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

#### Persiapan data frame

In [3]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows, n_cols)), 
    columns = cols)
df

   A  B  C  D  E
0  9  4  5  4  4
1  9  6  6  4  5
2  1  6  7  7  4
3  5  3  1  8  2
4  7  9  2  2  4

#### nemambahkan prefix kolom(prefix = string di depan string tertentu)

In [4]:
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        9        4        5        4        4
1        9        6        6        4        5
2        1        6        7        7        4
3        5        3        1        8        2
4        7        9        2        2        4

#### menyertakan suffix kolom (suffix = string di belakang string tertentu)

In [5]:
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        9        4        5        4        4
1        9        6        6        4        5
2        1        6        7        7        4
3        5        3        1        8        2
4        7        9        2        2        4

## Pemeliharan Row

https://www.youtube.com/watch?v=GPh8sBGp0FM

#### persiapan data frame

In [7]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,5,size=(n_rows, n_cols)), 
    columns = cols)
df

   A  B  C  D  E
0  1  1  4  2  3
1  2  4  2  2  1
2  1  3  1  3  1
3  2  3  4  1  1
4  2  2  4  2  1
5  3  3  3  3  1
6  2  4  2  4  3
7  3  1  2  4  4
8  1  2  3  3  1
9  1  3  2  3  4

#### selection dengan operator logika | (| pipe char) / or

In [8]:
df[(df['A'] == 1) | (df['A'] == 3)] #hanya angka 1 dan 3 yang keluar

   A  B  C  D  E
0  1  1  4  2  3
2  1  3  1  3  1
5  3  3  3  3  1
7  3  1  2  4  4
8  1  2  3  3  1
9  1  3  2  3  4

#### selection dengan fungsi isin() atau (logika or)

In [9]:
df[(df['A']).isin([1,3])]

   A  B  C  D  E
0  1  1  4  2  3
2  1  3  1  3  1
5  3  3  3  3  1
7  3  1  2  4  4
8  1  2  3  3  1
9  1  3  2  3  4

#### mengenal operator negasi ~ ( ~ karakter pilder)

In [11]:
df[~df['A'].isin([1,3])]

   A  B  C  D  E
1  2  4  2  2  1
3  2  3  4  1  1
4  2  2  4  2  1
6  2  4  2  4  3

## konversi tipe data numerik

https://youtu.be/hFlyIYCuuno

#### Persiapan data Frame

In [13]:
#dictionary
data = {'col1':['1','2','3','teks'],
        'col2' :['1','2','3','4']}

#membuat dataframenya
df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [14]:
df.dtypes

col1    object
col2    object
dtype: object

df.dtypes : untuk menunjukan tipe data dari setiap kolom

tanda '  ' menunjukan string sehingga menjadi object

#### konversi tipe data dengan fungsi astype()

In [16]:
df_x = df.astype({'col2':'int'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [17]:
df_x.dtypes

col1    object
col2     int32
dtype: object

#### konversi tipe data numerik dnegan fungsi to_numeric()

In [18]:
df.apply(pd.to_numeric, errors = 'coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

coerce itu kalau tipe datanya salah / tidak sesuai nanti hasilnya bakal jadi NaN (missing Value)

##  pemilihan kolom berdasarkan tipe data

https://youtu.be/mxHWi8FY0T4

#### Persiapan data frame

In [20]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size =(n_rows, n_cols)),
        columns = cols) #bikin col bulat

df['bil_pecahan'] = df['bil_pecahan'].astype('float') #bikin col pecahan

df.index = pd.util.testing.makeDateIndex(n_rows, freq = 'H') #bikin col date
df = df.reset_index()

df['teks'] = list('ABCDE') #bikin col txt
 
df

D:\Anaconda\lib\site-packages\pandas\util\__init__.py:12: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00          8.0          1    A
1 2000-01-01 01:00:00          4.0         19    B
2 2000-01-01 02:00:00          9.0          2    C
3 2000-01-01 03:00:00         19.0          5    D
4 2000-01-01 04:00:00         12.0         13    E

In [21]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

memilih kolom bertipe data numerik

In [23]:
df.select_dtypes(include = 'number')

   bil_pecahan  bil_bulat
0          8.0          1
1          4.0         19
2          9.0          2
3         19.0          5
4         12.0         13

In [24]:
df.select_dtypes(include = 'int')

   bil_bulat
0          1
1         19
2          2
3          5
4         13

number = tipe data number bisa pecahan, bisa bulet

float = tipe data pecahan

int = tipe data bulat

#### memilih tipe data Object atau string

In [29]:
df.select_dtypes(include = 'object')

  teks
0    A
1    B
2    C
3    D
4    E

memilih tipe data datetime

In [30]:
df.select_dtypes(include = 'datetime')

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

memilih kolom dengan kombinasi tipe data

In [31]:
df.select_dtypes(include = ['number','object'])

   bil_pecahan  bil_bulat teks
0          8.0          1    A
1          4.0         19    B
2          9.0          2    C
3         19.0          5    D
4         12.0         13    E

object = teks